---
kind: enumMember
id: F:Autodesk.Revit.DB.PartsVisibility.ShowPartsAndOriginal
enum: Autodesk.Revit.DB.PartsVisibility
source: html/95aab269-5f16-1080-6948-11dd7535af08.htm
---
# Autodesk.Revit.DB.PartsVisibility.ShowPartsAndOriginal

Show both original elements and parts for the view.